'use strict';
/* ============================================================
   ЗАЩИЩАЕМЫЕ ОБЪЕКТЫ
   ============================================================ */

/* ---------- защищаемые объекты ---------- */
const OT = {
  power: { n: 'ТЭС / ТЭЦ', hard: .9, en: 1 },
  sub: { n: 'Подстанция', hard: 1.1, en: 1 },
  dam: { n: 'ГЭС', hard: .6, en: 1 },
  port: { n: 'Порт', hard: .9 },
  oil: { n: 'НПЗ / нефтебаза', hard: 1.2 },
  air: { n: 'Авиабаза', hard: .8 },
  rail: { n: 'Железнодорожный узел', hard: .8 },
  plant: { n: 'Завод', hard: .9 },
  water: { n: 'Водозабор', hard: 1 }
};
